# Data Frames

In [61]:
import numpy as np
import pandas as pd

Creating data frame

In [62]:
data = {
    'Name': ['John', 'Anna', 'Peter',  'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [63]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [64]:
data_list = [
    ['John', '28', 'New York',  '65000'],
    ['Anna', '34', 'Paris',  '70000'],
    ['Peter', '29', 'Berlin',  '62000'],
    ['Linda', '42', 'London',  '85000']
]
df2 = pd.DataFrame(data_list)
column = ['Name',	'Age',	'City',	'Salary']

In [65]:
#pd.DataFrame(data_list,columns=column) #Insted of this we can do this ðŸ‘‡
df2 = pd.DataFrame(data_list, columns= column)
df2

    Name Age      City Salary
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

Selection & Indexing of DataFrame

In [66]:
df2

    Name Age      City Salary
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [67]:
df2[['Name','City']]  # If want multiple selection so make list into list.

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

Creating new column

In [68]:
df2['Designation'] = ['Doctor', 'Engineer', 'Civil', 'Gamer']

In [69]:
df2

    Name Age      City Salary Designation
0   John  28  New York  65000      Doctor
1   Anna  34     Paris  70000    Engineer
2  Peter  29    Berlin  62000       Civil
3  Linda  42    London  85000       Gamer

Removing Column

In [70]:
# Axis = 0 works for rows & axis= 1 Works for column.
df2.drop('Designation', axis = 1)

    Name Age      City Salary
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [71]:
# Here's 'drop' just show a snapshot of removing column but it can't remove it permanently so we use 'inplace'
df2.drop('Designation', axis= 1, inplace= True)

In [72]:
df2

    Name Age      City Salary
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [73]:
# For Multiple Column Delete 
df2.drop(['Age', 'City'], axis= 1, inplace= True)
df2
# IF want to do for rows So we use axis = 0

    Name Salary
0   John  65000
1   Anna  70000
2  Peter  62000
3  Linda  85000

Selecting Row

In [ ]:
data_list1 = [
    ['John', '28', 'New York',  '65000'],
    ['Anna', '34', 'Paris',  '70000'],
    ['Peter', '29', 'Berlin',  '62000'],
    ['Linda', '42', 'London',  '85000']
]
df3 = pd.DataFrame(data_list)
column = ['Name', 'Age', 'City', 'Salary'] 
df3 = pd.DataFrame(data_list,columns= column)
df3

    Name Age      City Salary
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [75]:
df3.loc[[0,1]]

   Name Age      City Salary
0  John  28  New York  65000
1  Anna  34     Paris  70000

In [76]:
df3.iloc[3] # Basically iloc is used for row indexing

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

Selecting Subset of Rows and Columns

In [77]:
df.loc[[0,1]] [['City', 'Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [78]:
df.loc[[2,3]] [['Name', 'Age']]

    Name  Age
2  Peter   29
3  Linda   42

Condition Selection

In [79]:
df3

    Name Age      City Salary
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [80]:
# Here in our column Age is in string so we have to first convert it into int by using (to_numeric).
# here we handle error by using coerce-> tells if str not converting then print (NaN).
df3['Age'] = pd.to_numeric(df3['Age'], errors='coerce') 
df3[df3['Age']> 30]

    Name  Age    City Salary
1   Anna   34   Paris  70000
3  Linda   42  London  85000

In [81]:
df3[(df3['Age'] > 30) & (df3['City'] == 'Paris')]

   Name  Age   City Salary
1  Anna   34  Paris  70000